#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.commons.azurerm_cosmosdb_sql_container.subscription_history will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_container" "subscription_history" {
        id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/subscription-history"
        name                  = "subscription-history"
        # (6 unchanged attributes hidden)

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          + excluded_path {
              + path = "/"_etag"/?"
            }

            # (2 unchanged blocks hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_private_endpoint.sql will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "ts-p-itn-private-endpoint-sql-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ts-p-itn-net-rg-01"
      + subnet_id                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-pendpoints-snet-01"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ts-p-itn-private-endpoint-sql"
          + private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "Sql",
            ]
        }
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (28 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (24 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 10
          ~ ip_restriction_default_action           = "Allow" -> "Deny"
            # (25 unchanged attributes hidden)

          - ip_restriction {
              - action     = "Allow" -> null
              - headers    = [] -> null
              - ip_address = "95.248.217.30/32" -> null
              - name       = "local test" -> null
              - priority   = 65000 -> null
            }
          - ip_restriction {
              - action     = "Allow" -> null
              - headers    = [] -> null
              - ip_address = "93.56.160.203/32" -> null
              - name       = "marco local test" -> null
              - priority   = 65000 -> null
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
